'''
3种方法:
    - 实例方法:
        -定义:第一个参数必须是实例对象，该参数名一般约定为“self”，
            通过它来传递实例的属性和方法（也可以传类的属性和方法）
        - 调用: 只能由实例对象调用
    - 类方法:
        - 定义: 使用装饰器@classmethod。第一个参数必须是当前类对象，
            该参数名一般约定为“cls”，通过它来传递类的属性和方法（不能传实例的属性和方法）；
        - 调用:实例对象和类对象都可以调用
    - 静态方法:
        - 定义:使用装饰器@staticmethod。参数随意，没有“self”和“cls”参数，
            但是方法体中不能使用类或实例的任何属性和方法
        - 调用:实例对象和类对象都可以调用

- 类方法: 原则上，类方法是将类本身作为对象进行操作的方法。
    假设有个方法，且这个方法在逻辑上采用类本身作为对象来调用更合理，
    那么这个方法就可以定义为类方法。另外，如果需要继承，也可以定义为类方法.

- 静态方法: 静态方法是类中的函数，不需要实例。静态方法主要是用来存放逻辑性的代码，
    逻辑上属于类，但是和类本身没有关系，也就是说在静态方法中，不会涉及到类中的属性和方法的操作。
    可以理解为，静态方法是个独立的、单纯的函数，它仅仅托管于某个类的名称空间中，便于使用和维护。
'''

class Person():

    # 实例方法
    def work(self):
      print('work.........')

    # 类方法
    # 第一个参数一般命名为cls,区别self
    @classmethod
    def sleey(cls):
        print('sleepy.........')

    # 静态方法
    # 参数随意
    @staticmethod
    def say():
        print('say..........')


p = Person()

p.work()

p.sleey()
Person.sleey()

p.say()
Person.say()