import numpy as np
import pandas as pd

# === 浮点数直接相减会出现这样的情况 ===

a = 3.2
b = 3.3
# print(b-a)
'''
0.09999999999999964
'''
# 为啥不是0.1，这是因为小数以二进制形式表示时的有穷性导致的


# === 如果是两列相减就不会出现这种情况 ===

df4 = pd.DataFrame([[1.12, 2.23, 3.3, ],
                    [2.32, 3.87, 4.656],
                    [2.32, 4.63, 4.54],
                    [1, 3, 3.2]],
                   columns=['c1', 'c2', 'c3'])

df4['differ'] = df4["c3"] - df4['c2']
# print(df4)
'''
     c1    c2     c3  differ
0  1.12  2.23  3.300   1.070
1  2.32  3.87  4.656   0.786
2  2.32  4.63  4.540  -0.090
3  1.00  3.00  3.200   0.200
'''